{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "new_decoder_inputs", "class_name": "InputLayer", "config": {"batch_input_shape": [1, null, 801], "dtype": "float32", "sparse": false, "name": "new_decoder_inputs"}, "inbound_nodes": []}, {"name": "new_decoder_lstm", "class_name": "LSTM", "config": {"name": "new_decoder_lstm", "trainable": true, "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": true, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["new_decoder_inputs", 0, 0, {}]]]}, {"name": "new_decoder_dense", "class_name": "Dense", "config": {"name": "new_decoder_dense", "trainable": true, "units": 801, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["new_decoder_lstm", 0, 0, {}]]]}], "input_layers": [["new_decoder_inputs", 0, 0]], "output_layers": [["new_decoder_dense", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "new_decoder_dense/kernel", "shape": [256, 801], "dtype": "float32"}, {"name": "new_decoder_dense/bias", "shape": [801], "dtype": "float32"}]}, {"paths": ["group2-shard1of2", "group2-shard2of2"], "weights": [{"name": "new_decoder_lstm/kernel", "shape": [801, 1024], "dtype": "float32"}, {"name": "new_decoder_lstm/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "new_decoder_lstm/bias", "shape": [1024], "dtype": "float32"}]}]}